package cn.yyy.day06.demo01;

/**
 * 一、类和对象
 * 环顾周围，你会发现很多对象，比如桌子、椅子、同学、老师等。桌椅属于办公用品，师生都是人类。
 * 那么什么是类呢？什么是对象呢？
 * <p>
 * 什么是类
 * 类：是一组相关属性和行为的集合。可以看成是一类事物的模板，使用事物的属性特征和行为特征来描述该类事物。
 * 现实中，描述一类事物：
 * 属性：就是该事物的状态信息。
 * 行为：就是该事物能够做什么。
 * 举例：小猫
 * 属性：名字、体重、年龄、颜色
 * 行为：走、跑、叫。
 * <p>
 * 什么是对象
 * 对象：是一类事物的具体体现。对象是类的一个实例，必然具备该类事物的属性和行为。
 * 现实中，一类事物的一个实例：一只小猫
 * 举例：一只小猫。
 * 属性：tom、5kg、2years、yellow
 * 行为：溜墙根走、蹦跶的跑、喵喵叫。
 * <p>
 * 类与对象的关系
 * 类是对一类事物的描述，是抽象的。
 * 对象是一类事物的实例，是具体的。
 * 类是对象的模板，对象是类的实体。
 *
 *
 */
public class Demo01Class {
}
